       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATM-MACHINE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
      *FILE USED FOR THE PROGRAM
       FILE-CONTROL.
               SELECT USERDATA ASSIGN TO
       "C:\Users\tyron\OneDrive\Desktop\COBOL\ATM-MACHINE\files.txt"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY F-PASSWORD.
       DATA DIVISION.
       FILE SECTION.
       FD USERDATA.
       01 F-DATA.
         02 F-PASSWORD PIC X(20) VALUE SPACES.
         02 F-NAME PIC X(20) VALUE SPACES.
         02 F-AGE PIC Z9 VALUE ZEROES.
         02 F-BALANCE PIC S9(12).
         02 F-USERNAME PIC X(20) VALUE SPACES.
       WORKING-STORAGE SECTION.
       01 WS-USERNAME PIC X(20) VALUE ZEROES.
      *EXISTS VARIABLE
       01 WS-IS-EXISTS PIC 9.
      * VAR FOR USER CHOICE
       01 WS-CHOICE PIC Z.
       01 WS-MAIN-CHOICE PIC Z.
      *TRANSACTION VARIABLES
       01 WS-BALANCE PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-DEPOSIT PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-WITHDRAW PIC -ZZZ,ZZZ,ZZZ,ZZ9.
      *TRANSACTION VARIABLES FOR COMPUTATION
       01 WS-C-BALANCE PIC S9(12).
       01 WS-C-DEPOSIT PIC S9(12).
       01 WS-C-WITHDRAW PIC S9(12).
      *QUIT VARIABLE
       01 WS-QUIT PIC X.
      * VARIABLES FOR BORDER LINE
       01 I PIC 9(3) VALUE ZEROES.
       01 J PIC 9(3) VALUE ZEROES.
       01 GEN-NUM PIC 9(3) VALUE ZEROES.
       01 GEN-COL PIC 9 VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN I-O USERDATA.
           PERFORM UNTIL WS-MAIN-CHOICE IS EQUAL TO 3
             DISPLAY " " ERASE SCREEN
             PERFORM P-BOARDER
             PERFORM P-STARS
             DISPLAY "ATM MACHINE COBOL PROGRAM" AT 0647
             DISPLAY "1 - SIGN-IN" AT 0850
             DISPLAY "2 - LOG-IN" AT 0950
             DISPLAY "3 - EXIT" AT 1050
             DISPLAY "ENTER YOUR CHOICE:" AT 1150
             ACCEPT WS-MAIN-CHOICE AT 1169
             EVALUATE WS-MAIN-CHOICE
               WHEN 1 PERFORM SIGN-IN
               WHEN 2 PERFORM LOG-IN
               WHEN 3 EXIT
             END-EVALUATE
           END-PERFORM.
           CLOSE USERDATA.
           DISPLAY " " ERASE SCREEN.
           STOP RUN.
       SIGN-IN.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "SIGN-IN SECTION" AT 0653.
           DISPLAY "ENTER YOUR NAME:" AT 0850.
           ACCEPT F-NAME AT 0867.
           DISPLAY "ENTER YOUR AGE:" AT 0950.
           ACCEPT F-AGE AT 0966.
           IF F-AGE IS LESS THAN 18 THEN
             DISPLAY "YOU ARE NOT OLD ENOUGH TO ENTER" AT 1144
             PERFORM P-PAUSE
             PERFORM MAIN-PROCEDURE
           END-IF.
           DISPLAY "ENTER USERNAME:" AT 1050.
           ACCEPT F-USERNAME AT 1066.
           DISPLAY "ENTER PASSWORD:" AT 1150.
           ACCEPT F-PASSWORD AT 1166.
           MOVE 0 TO F-BALANCE.
           WRITE F-DATA
             INVALID KEY DISPLAY "PASSWORD IS ALREADY BEEN USED" AT 1442
           END-WRITE.
           PERFORM P-PAUSE.
           EXIT.
       LOG-IN.
           MOVE 0 TO WS-IS-EXISTS.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "LOG-IN SECTION" AT 0653.
           DISPLAY "ENTER YOUR USERNAME:" AT 0850.
           ACCEPT WS-USERNAME AT 0871.
           DISPLAY "ENTER YOUR PASSWORD:" AT 0950.
           ACCEPT F-PASSWORD AT 0971.
           READ USERDATA
             INVALID KEY MOVE 1 TO WS-IS-EXISTS
           END-READ.
           IF WS-IS-EXISTS IS EQUAL TO 1 THEN
             DISPLAY "YOU ENTERED WRONG PASSWORD" AT 1146
             PERFORM P-PAUSE
           ELSE
             IF WS-USERNAME IS NOT EQUAL TO F-USERNAME THEN
               DISPLAY "YOU ENTERED WRONG USERNAME" AT 1146
               PERFORM P-PAUSE
             ELSE
               PERFORM ATM UNTIL WS-CHOICE IS EQUAL TO 6
             END-IF
           END-IF.
           EXIT.
      *MAIN PAGE OF ATM
       ATM.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "ATM CONSOLE PROGRAM" AT 0650.
           DISPLAY "1 - BALANCE" AT 0752.
           DISPLAY "2 - DEPOSIT" AT 0852.
           DISPLAY "3 - WITHDRAW" AT 0952.
           DISPLAY "4 - PROFILE" AT 1052.
           DISPLAY "5 - DELETE ACCOUNT" AT 1152.
           DISPLAY "6 - EXIT" AT 1252.
           DISPLAY "ENTER YOUR CHOICE:" AT 1352.
           ACCEPT WS-CHOICE AT 1371.
           EVALUATE WS-CHOICE
               WHEN 1 PERFORM P-BALANCE
               WHEN 2 PERFORM P-DEPOSIT
               WHEN 3 PERFORM P-WITHDRAW
               WHEN 4 PERFORM P-PROFILE
               WHEN 5 PERFORM P-DELETE
           END-EVALUATE.
           IF WS-IS-EXISTS = 1 THEN
             CLOSE USERDATA
           END-IF.
           PERFORM P-PAUSE.
           EXIT.

      *BALANCE SECTION
       P-BALANCE.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "BALANCE SECTION" AT 0652.
           DISPLAY "CURRENT BALANCE: " AT 0842.
           MOVE F-BALANCE TO WS-BALANCE.
           DISPLAY WS-BALANCE AT 0860.
           EXIT.

      *DEPOSIT SECTION
       P-DEPOSIT.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "DEPOSIT SECTION" AT 0652.
           DISPLAY "ENTER THE AMOUNT TO DEPOSIT:" AT 0842.
           ACCEPT WS-DEPOSIT AT 0874.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           MOVE WS-DEPOSIT TO WS-C-DEPOSIT.
           ADD WS-C-DEPOSIT TO WS-C-BALANCE.
           MOVE WS-C-BALANCE TO F-BALANCE.
           REWRITE F-DATA
           END-REWRITE.
           EXIT.

      *WITHDRAW SECTION
       P-WITHDRAW.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "WITHDRAW SECTION" AT 0651.
           DISPLAY "ENTER THE AMOUNT TO WITHDRAW:" AT 0841.
           ACCEPT WS-WITHDRAW AT 0873.
           MOVE WS-WITHDRAW TO WS-C-WITHDRAW.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           IF WS-C-WITHDRAW IS LESS THAN 0 THEN
               DISPLAY "INVALID AMOUNT"
           ELSE IF WS-C-WITHDRAW IS GREATER THAN WS-C-BALANCE THEN
               DISPLAY "INSUFFICIENT BALANCE" AT 0949
           ELSE
               SUBTRACT WS-C-WITHDRAW FROM WS-C-BALANCE
               GIVING WS-C-BALANCE
               MOVE WS-C-BALANCE TO F-BALANCE
               REWRITE F-DATA
               END-REWRITE
           END-IF.
           EXIT.

      *PROFILE SECTION
       P-PROFILE.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "PROFILE SECTION" AT 0652.
           DISPLAY "NAME:" AT 0850
           DISPLAY F-NAME AT 0856.
           DISPLAY "AGE:" AT 0950.
           DISPLAY F-AGE AT 0955.
           DISPLAY "CURRENT BALANCE:" AT 1050.
           MOVE F-BALANCE TO WS-BALANCE.
           DISPLAY WS-BALANCE AT 1067.
           EXIT.
      *DELETE ACCOUNT
       P-DELETE.
           MOVE 0 TO WS-IS-EXISTS.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "DELETE ACCOUNT" AT 0653.
           DISPLAY "ENTER YOUR PASSWORD:" AT 0850.
           ACCEPT F-PASSWORD AT 0871.
           READ USERDATA
             INVALID KEY MOVE 1 TO WS-IS-EXISTS
           END-READ.
           IF WS-IS-EXISTS = 0 THEN
             IF F-BALANCE > 50 THEN
               DISPLAY "YOU STILL HAVE MORE THAN 50 BALANCE" AT 1042
               DISPLAY "PLEASE WITHDRAW YOU MONEY FIRST" AT 1144
               MOVE 0 TO WS-IS-EXISTS
             ELSE
               DELETE USERDATA
               END-DELETE
               MOVE 6 TO WS-CHOICE
             END-IF
           ELSE
             DISPLAY "YOU ENTERED A WRONG PASSWORD" AT 1041
             MOVE 0 TO WS-IS-EXISTS
           END-IF.
           EXIT.
      *PAUSE SECTION
       P-PAUSE.
           DISPLAY "PRESS ENTER KEY TO CONTINUE..." AT 1644.
           ACCEPT WS-QUIT AT 1674.
           EXIT.
       P-BOARDER.
           PERFORM VARYING I FROM 15 BY 1 UNTIL I > 105
             DISPLAY "*" AT LINE 004 POSITION I
           END-PERFORM.
           PERFORM VARYING I FROM 5 BY 1 UNTIL I > 26
             DISPLAY "*" AT LINE I POSITION 15
             DISPLAY "*" AT LINE I POSITION 105
           END-PERFORM.
           PERFORM VARYING I FROM 15 BY 1 UNTIL I > 105
             DISPLAY "*" AT LINE 26 POSITION I
           END-PERFORM.
           EXIT.
       P-STARS.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >= 30
             PERFORM VARYING J FROM 1 BY 1 UNTIL J >= 10
               COMPUTE GEN-NUM = FUNCTION RANDOM * (118 + 1) + 1
               COMPUTE GEN-COL = FUNCTION RANDOM * (6 + 1) + 1
               IF (GEN-NUM < 15 OR GEN-NUM > 105) OR
                 (I < 4 OR I > 26) THEN
                 DISPLAY "+" AT LINE I POSITION GEN-NUM
                 FOREGROUND-COLOR GEN-COL
               END-IF
             END-PERFORM
           END-PERFORM.
           EXIT.
       END PROGRAM ATM-MACHINE.
