       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATM-MACHINE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
      *FILE USED FOR THE PROGRAM
       FILE-CONTROL.
               SELECT USERDATA ASSIGN TO
       "C:\Users\tyron\OneDrive\Desktop\COBOL\ATM-MACHINE\files.txt"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY F-PASSWORD.
       DATA DIVISION.
       FILE SECTION.
       FD USERDATA.
       01 F-DATA.
         02 F-PASSWORD PIC X(20) VALUE SPACES.
         02 F-NAME PIC X(20) VALUE SPACES.
         02 F-AGE PIC Z9 VALUE ZEROES.
         02 F-BAL PIC 9(12).
       WORKING-STORAGE SECTION.
       01 WS-GEN-PIN PIC 9(6) VALUE ZEROES.
      *EXISTS VARIABLE
       01 WS-IS-EXISTS PIC 9.
      * VAR FOR USER CHOICE
       01 WS-CHOICE PIC Z.
       01 WS-MAIN-CHOICE PIC Z.
      *TRANSACTION VARIABLES
       01 WS-AMOUNT PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-C-AMOUNT PIC 9(12) VALUE ZEROES.
      *TRANSACTION VARIABLES FOR COMPUTATION
       01 WS-DEPOSIT PIC 9(12) VALUE ZEROES.
       01 WS-WITHDRAW PIC 9(12) VALUE ZEROES.
      *QUIT VARIABLE
       01 WS-QUIT PIC X.
      * VARIABLES FOR BORDER LINE
       01 I PIC 9(3) VALUE ZEROES.
       01 J PIC 9(3) VALUE ZEROES.
       01 GEN-NUM PIC 9(3) VALUE ZEROES.
       01 GEN-COL PIC 9 VALUE ZERO.
      * VARIABLE FOR MESSSAGE
       01 WS-MES PIC X(8) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN I-O USERDATA.
           PERFORM UNTIL WS-MAIN-CHOICE IS EQUAL TO 3
             DISPLAY " " ERASE SCREEN
             PERFORM P-BOARDER
             PERFORM P-STARS
             DISPLAY "ATM MACHINE COBOL PROGRAM" AT 0647
             FOREGROUND-COLOR 3
             DISPLAY "1 - SIGN-IN" AT 0850
             DISPLAY "2 - LOG-IN" AT 0950
             DISPLAY "3 - EXIT" AT 1050
             DISPLAY "ENTER YOUR CHOICE:" AT 1150
             ACCEPT WS-MAIN-CHOICE AT 1169
             MOVE 0 TO F-BAL
             ADD 1 TO F-BAL
             EVALUATE WS-MAIN-CHOICE
               WHEN 1 PERFORM SIGN-IN
               WHEN 2 PERFORM LOG-IN
               WHEN 3 EXIT
               WHEN OTHER DISPLAY "THAT IS A INVALID CHOICE" AT 1643
             END-EVALUATE
           END-PERFORM.
           CLOSE USERDATA.
           DISPLAY " " ERASE SCREEN.
           STOP RUN.
       SIGN-IN.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "SIGN-IN SECTION" AT 0653 FOREGROUND-COLOR 3.
           DISPLAY "ENTER YOUR NAME:" AT 0850.
           ACCEPT F-NAME AT 0867.
           DISPLAY "ENTER YOUR AGE:" AT 0950.
           ACCEPT F-AGE AT 0966.
           IF F-AGE IS LESS THAN 18 THEN
             DISPLAY "YOU ARE NOT OLD ENOUGH TO ENTER" AT 1144
             FOREGROUND-COLOR 4
             PERFORM P-PAUSE
             PERFORM MAIN-PROCEDURE
           END-IF.
           COMPUTE WS-GEN-PIN = FUNCTION RANDOM * (99999 + 1) + 99999
           MOVE WS-GEN-PIN TO F-PASSWORD.
           DISPLAY "GENERATED PIN:" AT 1050.
           DISPLAY F-PASSWORD AT 1065.
           MOVE ZERO TO F-BAL.
           WRITE F-DATA
             INVALID KEY DISPLAY
             "SOMETHING WENT WRONG, PLEASE TRY AGAIN" AT 1341
           END-WRITE.
           PERFORM P-PAUSE.
           EXIT.
       LOG-IN.
           MOVE SPACES TO F-PASSWORD.
           MOVE 0 TO WS-IS-EXISTS.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "LOG-IN SECTION" AT 0653 FOREGROUND-COLOR 3.
           DISPLAY "ENTER YOUR PIN:" AT 0950.
           ACCEPT F-PASSWORD AT 0966.
           READ USERDATA
             INVALID KEY MOVE 1 TO WS-IS-EXISTS
           END-READ.
           IF WS-IS-EXISTS IS EQUAL TO 1 THEN
             DISPLAY "YOU ENTERED WRONG PASSWORD" AT 1146
             FOREGROUND-COLOR 4
             PERFORM P-PAUSE
           ELSE
             MOVE F-BAL TO WS-AMOUNT
             PERFORM ATM UNTIL WS-CHOICE IS EQUAL TO 6
           END-IF.
           EXIT.
      *MAIN PAGE OF ATM
       ATM.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "ATM CONSOLE PROGRAM" AT 0650 FOREGROUND-COLOR 3.
           DISPLAY "1 - BALANCE" AT 0752.
           DISPLAY "2 - DEPOSIT" AT 0852.
           DISPLAY "3 - WITHDRAW" AT 0952.
           DISPLAY "4 - PROFILE" AT 1052.
           DISPLAY "5 - DELETE ACCOUNT" AT 1152.
           DISPLAY "6 - EXIT" AT 1252.
           DISPLAY "ENTER YOUR CHOICE:" AT 1352.
           ACCEPT WS-CHOICE AT 1371.
           EVALUATE WS-CHOICE
               WHEN 1 PERFORM P-BALANCE
               WHEN 2 PERFORM P-DEPOSIT
               WHEN 3 PERFORM P-WITHDRAW
               WHEN 4 PERFORM P-PROFILE
               WHEN 5 PERFORM P-DELETE
               WHEN 6 EXIT
               WHEN OTHER DISPLAY "THAT IS A INVALID CHOICE" AT 1643
           END-EVALUATE.
           REWRITE F-DATA
           END-REWRITE.
           PERFORM P-PAUSE.
           EXIT.

      *BALANCE SECTION
       P-BALANCE.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "BALANCE SECTION" AT 0652 FOREGROUND-COLOR 3.
           DISPLAY "CURRENT BALANCE: " AT 0842.
           MOVE F-BAL TO WS-AMOUNT.
           DISPLAY WS-AMOUNT AT 0860.
           EXIT.

      *DEPOSIT SECTION
       P-DEPOSIT.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           MOVE F-BAL TO WS-AMOUNT.
           MOVE WS-AMOUNT TO WS-DEPOSIT.
           DISPLAY "DEPOSIT SECTION" AT 0652 FOREGROUND-COLOR 3.
           DISPLAY "ENTER THE AMOUNT TO DEPOSIT:" AT 0842.
           ACCEPT WS-AMOUNT AT 0871.
           MOVE WS-AMOUNT TO WS-C-AMOUNT.
           COMPUTE WS-DEPOSIT = WS-DEPOSIT + WS-C-AMOUNT.
           MOVE WS-DEPOSIT TO F-BAL.
           REWRITE F-DATA
           END-REWRITE.
           MOVE "DEPOSIT" TO WS-MES.
           PERFORM P-BUNNY.
           EXIT.

      *WITHDRAW SECTION
       P-WITHDRAW.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "WITHDRAW SECTION" AT 0651 FOREGROUND-COLOR 3.
           DISPLAY "ENTER THE AMOUNT TO WITHDRAW:" AT 0841.
           ACCEPT WS-AMOUNT AT 0873.
           MOVE WS-AMOUNT TO WS-WITHDRAW.
           IF WS-WITHDRAW IS LESS THAN 0 THEN
               DISPLAY "INVALID AMOUNT" FOREGROUND-COLOR 4
           ELSE IF WS-WITHDRAW IS GREATER THAN F-BAL THEN
               DISPLAY "INSUFFICIENT BALANCE" AT 0949 FOREGROUND-COLOR 4
           ELSE
               SUBTRACT WS-WITHDRAW FROM F-BAL
               GIVING F-BAL
               REWRITE F-DATA
               END-REWRITE
               MOVE "WITHDRAW" TO WS-MES
               PERFORM P-BUNNY
           END-IF.
           EXIT.

      *PROFILE SECTION
       P-PROFILE.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "PROFILE SECTION" AT 0652 FOREGROUND-COLOR 3.
           DISPLAY "NAME:" AT 0850
           DISPLAY F-NAME AT 0856.
           DISPLAY "AGE:" AT 0950.
           DISPLAY F-AGE AT 0955.
           DISPLAY "CURRENT BALANCE:" AT 1050.
           MOVE F-BAL TO WS-AMOUNT.
           DISPLAY WS-AMOUNT AT 1067.
           EXIT.
      *DELETE ACCOUNT
       P-DELETE.
           MOVE 0 TO WS-IS-EXISTS.
           DISPLAY " " ERASE SCREEN.
           PERFORM P-BOARDER.
           PERFORM P-STARS.
           DISPLAY "DELETE ACCOUNT" AT 0653.
           DISPLAY "ENTER YOUR PASSWORD:" AT 0850.
           ACCEPT F-PASSWORD AT 0871.
           READ USERDATA
             INVALID KEY MOVE 1 TO WS-IS-EXISTS
           END-READ.
           IF WS-IS-EXISTS = 0 THEN
             IF F-BAL > 50 THEN
               DISPLAY "YOU STILL HAVE MORE THAN 50 BALANCE" AT 1042
               FOREGROUND-COLOR 4
               DISPLAY "PLEASE WITHDRAW YOU MONEY FIRST" AT 1144
               FOREGROUND-COLOR 4
               MOVE 0 TO WS-IS-EXISTS
             ELSE
               DELETE USERDATA
               END-DELETE
               MOVE 6 TO WS-CHOICE
             END-IF
           ELSE
             DISPLAY "YOU ENTERED A WRONG PASSWORD" AT 1041
             FOREGROUND-COLOR 4
             MOVE 0 TO WS-IS-EXISTS
           END-IF.
           EXIT.
      *PAUSE SECTION
       P-PAUSE.
           DISPLAY "PRESS ENTER KEY TO CONTINUE..." AT 1644.
           ACCEPT WS-QUIT AT 1674.
           EXIT.
       P-BOARDER.
           PERFORM VARYING I FROM 15 BY 1 UNTIL I > 105
             DISPLAY "*" AT LINE 004 POSITION I
           END-PERFORM.
           PERFORM VARYING I FROM 5 BY 1 UNTIL I > 26
             DISPLAY "*" AT LINE I POSITION 15
             DISPLAY "*" AT LINE I POSITION 105
           END-PERFORM.
           PERFORM VARYING I FROM 15 BY 1 UNTIL I > 105
             DISPLAY "*" AT LINE 26 POSITION I
           END-PERFORM.
           EXIT.
       P-STARS.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >= 30
             PERFORM VARYING J FROM 1 BY 1 UNTIL J >= 7
               COMPUTE GEN-NUM = FUNCTION RANDOM * (118 + 1) + 1
               COMPUTE GEN-COL = FUNCTION RANDOM * (6 + 1) + 1
               IF (GEN-NUM < 15 OR GEN-NUM > 105) OR
                 (I < 4 OR I > 26) THEN
                 DISPLAY "+" AT LINE I POSITION GEN-NUM
                 FOREGROUND-COLOR GEN-COL
               END-IF
             END-PERFORM
           END-PERFORM.
           EXIT.
       P-BUNNY.
           DISPLAY "   /\_/\" AT 2168.
           DISPLAY " _(,`-`,)__________________________" AT 2268.
           DISPLAY "|   U U                            |" AT 2368.
           DISPLAY "|   THANK YOU FOR YOUR" AT 2468
           DISPLAY WS-MES AT 2491.
           DISPLAY "    |" AT 2499.
           DISPLAY "|__________________________________|" AT 2568.
           EXIT.
       END PROGRAM ATM-MACHINE.
