       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATM-MACHINE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
      *FILE USED FOR THE PROGRAM
       FILE-CONTROL.
               SELECT DATAFILE ASSIGN TO
       "C:\Users\tyron\OneDrive\Desktop\COBOL\ATM-MACHINE\Data.txt"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY F-ID.
       DATA DIVISION.
       FILE SECTION.
      *VARIABLES TO WRITE INFORMATION TO THE FILE
       FD DATAFILE.
       01 USER-DATA.
         02 F-ID PIC 9(5) VALUE ZEROES.
         02 F-NAME PIC X(20) VALUE SPACES.
         02 F-AGE PIC 99 VALUE ZEROES.
         02 F-BALANCE PIC S9(12).
         02 F-USERNAME PIC X(20) VALUE SPACES.
         02 F-PASSWORD PIC X(20) VALUE SPACES.
       WORKING-STORAGE SECTION.
      *MENU USER CHOICE
       01 WS-CHOICE PIC Z.
      *QUIT VARIABLE
       01 WS-QUIT PIC X VALUE SPACE.
      *PROFILE VARIABLES
       01 WS-USER-PROFILE.
           02 WS-USER-ID PIC 9(5).
           02 WS-USER-NAME PIC X(20) VALUE SPACES.
      *    02 WS-USER-BIRTHDAY.
      *        03 MM PIC 99 VALUE ZEROES.
      *        03 DD PIC 99 VALUE ZEROES.
      *        03 YYYY PIC 9999 VALUE ZEROES.
           02 WS-USER-AGE PIC Z9 VALUE ZEROES.
           02 WS-USER-BALANCE PIC -ZZZ,ZZZ,ZZZ,ZZ9.
           02 WS-USERNAME PIC X(20) VALUE SPACES.
      *    02 WS-PASSWORD PIC X(20) VALUE SPACES.
      *TRANSACTION VARIABLES
       01 WS-BALANCE PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-DEPOSIT PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-WITHDRAW PIC -ZZZ,ZZZ,ZZZ,ZZ9.
      *TRANSACTION VARIABLES FOR COMPUTATION
       01 WS-C-BALANCE PIC S9(12).
       01 WS-C-DEPOSIT PIC S9(12).
       01 WS-C-WITHDRAW PIC S9(12).
       PROCEDURE DIVISION.
      *******************************************************
      *    THE LENGTH OF THE CONSOLE HORIZONTALLY IS 120    *
      *******************************************************
       MAIN.
      *    OPEN I-O DATAFILE.
           PERFORM UNTIL WS-CHOICE IS EQUAL TO 3
             DISPLAY " " ERASE SCREEN
             DISPLAY "ATAM MACHINE COBOL PROGRAM" AT 0647
             DISPLAY "1 - SIGN-IN" AT 0850
             DISPLAY "2 - LOG-IN" AT 0950
             DISPLAY "3 - EXIT" AT 1050
             DISPLAY "ENTER YOUR CHOICE:" AT 1150
             ACCEPT WS-CHOICE AT 1169
             EVALUATE WS-CHOICE
               WHEN 1 PERFORM SIGN-IN
               WHEN 2 PERFORM LOG-IN
               WHEN 3 EXIT
             END-EVALUATE
           END-PERFORM.
      *    CLOSE DATAFILE.
           DISPLAY " " ERASE SCREEN.
           STOP RUN.
      *PAUSE SECTION
       P-PAUSE.
           DISPLAY "PRESS ENTER KEY TO CONTINUE..." AT 1644.
           ACCEPT WS-QUIT AT 1674.
           EXIT.
      *SIGN-IN PAGE
       SIGN-IN.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "SIGN-IN SECTION" AT 0653.
           DISPLAY "ENTER YOUR NAME:" AT 0850.
           ACCEPT WS-USER-NAME AT 0867.
           DISPLAY "ENTER YOUR AGE:" AT 0950.
           ACCEPT WS-USER-AGE AT 0966.
           DISPLAY "ENTER USERNAME:" AT 1050.
           ACCEPT WS-USERNAME AT 1066.
           DISPLAY "ENTER YOUR PREFERED PIN (EX. 12345):" AT 1250
           ACCEPT WS-USER-ID AT 1288.
           DISPLAY "PLEASE REMEMBER YOUR PIN NUMBER" AT 1350.
           PERFORM P-PAUSE.
           EXIT.
      *LOG-IN PAGE
       LOG-IN.
           PERFORM ATM UNTIL WS-CHOICE IS EQUAL TO 5.
      *CODE TO BE WRITTEN
           EXIT.
      *MAIN PAGE OF ATM
       ATM.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "ATM CONSOLE PROGRAM" AT 0650.
      *    DISPLAY " ".
           DISPLAY "1 - BALANCE" AT 0752.
           DISPLAY "2 - DEPOSIT" AT 0852.
           DISPLAY "3 - WITHDRAW" AT 0952.
           DISPLAY "4 - PROFILE" AT 1052.
           DISPLAY "5 - EXIT" AT 1152.
           DISPLAY "ENTER YOUR CHOICE:" AT 1252.
           ACCEPT WS-CHOICE AT 1271.
           EVALUATE WS-CHOICE
               WHEN 1 PERFORM P-BALANCE
               WHEN 2 PERFORM P-DEPOSIT
               WHEN 3 PERFORM P-WITHDRAW
               WHEN 4 PERFORM P-PROFILE
           END-EVALUATE.
           PERFORM P-PAUSE.
           EXIT.

      *BALANCE SECTION
       P-BALANCE.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "BALANCE SECTION" AT 0652.
           DISPLAY "CURRENT BALANCE: " AT 0842.
           DISPLAY WS-BALANCE AT 0860.
           EXIT.

      *DEPOSIT SECTION
       P-DEPOSIT.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "DEPOSIT SECTION" AT 0652.
           DISPLAY "ENTER THE AMOUNT TO DEPOSIT:" AT 0842.
           ACCEPT WS-DEPOSIT AT 0874.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           MOVE WS-DEPOSIT TO WS-C-DEPOSIT.
           ADD WS-C-DEPOSIT TO WS-C-BALANCE.
           MOVE WS-C-BALANCE TO WS-BALANCE.
           EXIT.

      *WITHDRAW SECTION
       P-WITHDRAW.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "WITHDRAW SECTION" AT 0651.
           DISPLAY "ENTER THE AMOUNT TO WITHDRAW:" AT 0841.
           ACCEPT WS-WITHDRAW AT 0873.
           MOVE WS-WITHDRAW TO WS-C-WITHDRAW.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           IF WS-C-WITHDRAW IS LESS THAN 0 THEN
               DISPLAY "INVALID AMOUNT"
           ELSE IF WS-C-WITHDRAW IS GREATER THAN WS-C-BALANCE THEN
               DISPLAY "INSUFFICIENT BALANCE" AT 0949
           ELSE
               SUBTRACT WS-C-WITHDRAW FROM WS-C-BALANCE
               GIVING WS-C-BALANCE
               MOVE WS-C-BALANCE TO WS-BALANCE
           END-IF.
           EXIT.

      *PROFILE SECTION
       P-PROFILE.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "PROFILE SECTION" AT 0652.
           DISPLAY "NAME:" AT 0850
           DISPLAY WS-USER-NAME AT 0856.
           DISPLAY "AGE:" AT 1050.
           DISPLAY WS-USER-AGE AT 1055.
           DISPLAY "CURRENT BALANCE:" AT 1150.
           DISPLAY WS-USER-BALANCE AT 1167.
           EXIT.
       END PROGRAM ATM-MACHINE.
