       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATM-MACHINE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *MENU USER CHOICE
       01 WS-CHOICE PIC 9 VALUE 0.
      *QUIT VARIABLE
       01 WS-QUIT PIC X VALUE SPACE.
      *PROFILE VARIABLES
       01 WS-USER-PROFILE.
           02 WS-USER-NAME PIC X(20) VALUE "TYRON BECHAYDA".
           02 WS-USER-BIRTHDAY.
               03 MM PIC 99 VALUE 11.
               03 DD PIC 99 VALUE 12.
               03 YYYY PIC 9999 VALUE 2003.
           02 WS-USER-AGE PIC 99 VALUE 19.
           02 WS-USER-BALANCE PIC -ZZZ,ZZZ,ZZZ,ZZ9 VALUE "120000".
           02 WS-USERNAME PIC X(20) VALUE SPACES.
           02 WS-PASSWORD PIC X(20) VALUE SPACES.
      *TRANSACTION VARIABLES
       01 WS-BALANCE PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-DEPOSIT PIC -ZZZ,ZZZ,ZZZ,ZZ9.
       01 WS-WITHDRAW PIC -ZZZ,ZZZ,ZZZ,ZZ9.
      *TRANSACTION VARIABLES
       01 WS-C-BALANCE PIC S9(12).
       01 WS-C-DEPOSIT PIC S9(12).
       01 WS-C-WITHDRAW PIC S9(12).
       PROCEDURE DIVISION.
      *******************************************************
      *    THE LENGTH OF THE CONSOLE HORIZONTALLY IS 120    *
      *******************************************************
       MAIN.
           PERFORM ATM UNTIL WS-CHOICE IS EQUAL TO 5.
           DISPLAY " " ERASE SCREEN.
           STOP RUN.
      *PAUSE SECTION
       P-PAUSE.
           DISPLAY "PRESS ENTER KEY TO CONTINUE..." AT 1644.
           ACCEPT WS-QUIT AT 1674.
           EXIT.
      *MAIN PAGE OF ATM
       ATM.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "ATM CONSOLE PROGRAM" AT 0650.
      *    DISPLAY " ".
           DISPLAY "1 - BALANCE" AT 0752.
           DISPLAY "2 - DEPOSIT" AT 0852.
           DISPLAY "3 - WITHDRAW" AT 0952.
           DISPLAY "4 - PROFILE" AT 1052.
           DISPLAY "5 - EXIT" AT 1152.
           DISPLAY "ENTER YOUR CHOICE:" AT 1252.
           ACCEPT WS-CHOICE AT 1271.
           EVALUATE WS-CHOICE
               WHEN 1 PERFORM P-BALANCE
               WHEN 2 PERFORM P-DEPOSIT
               WHEN 3 PERFORM P-WITHDRAW
               WHEN 4 PERFORM P-PROFILE
           END-EVALUATE.
           PERFORM P-PAUSE.
           EXIT.

      *BALANCE SECTION
       P-BALANCE.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "BALANCE SECTION" AT 0652.
           DISPLAY "CURRENT BALANCE: " AT 0842.
           DISPLAY WS-BALANCE AT 0860.
           EXIT.

      *DEPOSIT SECTION
       P-DEPOSIT.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "DEPOSIT SECTION" AT 0652.
           DISPLAY "ENTER THE AMOUNT TO DEPOSIT:" AT 0842.
           ACCEPT WS-DEPOSIT AT 0874.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           MOVE WS-DEPOSIT TO WS-C-DEPOSIT.
           ADD WS-C-DEPOSIT TO WS-C-BALANCE.
           MOVE WS-C-BALANCE TO WS-BALANCE.
           EXIT.

      *WITHDRAW SECTION
       P-WITHDRAW.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "WITHDRAW SECTION" AT 0651.
           DISPLAY "ENTER THE AMOUNT TO WITHDRAW:" AT 0841.
           ACCEPT WS-WITHDRAW AT 0873.
           MOVE WS-WITHDRAW TO WS-C-WITHDRAW.
           MOVE WS-BALANCE TO WS-C-BALANCE.
           IF WS-C-WITHDRAW IS LESS THAN 0 THEN
               DISPLAY "INVALID AMOUNT"
           ELSE IF WS-C-WITHDRAW IS GREATER THAN WS-C-BALANCE THEN
               DISPLAY "INSUFFICIENT BALANCE" AT 0949
           ELSE
               SUBTRACT WS-C-WITHDRAW FROM WS-C-BALANCE
               GIVING WS-C-BALANCE
               MOVE WS-C-BALANCE TO WS-BALANCE
           END-IF.
           EXIT.

      *PROFILE SECTION
       P-PROFILE.
           DISPLAY " " ERASE SCREEN.
           DISPLAY "PROFILE SECTION" AT 0652.
           DISPLAY "NAME:" AT 0850
           DISPLAY WS-USER-NAME AT 0856.
           DISPLAY "BIRTHDAY:" AT 0950.
           DISPLAY DD AT 0960.
           DISPLAY "/" AT 0962.
           DISPLAY MM AT 0963.
           DISPLAY "/" AT 0965.
           DISPLAY YYYY AT 0966.
           DISPLAY "AGE:" AT 1050.
           DISPLAY WS-USER-AGE AT 1055.
           DISPLAY "CURRENT BALANCE:" AT 1150.
           DISPLAY WS-USER-BALANCE AT 1167.
           EXIT.
       END PROGRAM ATM-MACHINE.
